# HasReflection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform2D..::..HasReflection Property
Transform2D Class See Also
---
The boolean value that indicates whether this transformation produces reflection (i.e., is orientation-reversing).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public bool HasReflection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasReflection As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasReflection {
	bool get ();
}
```

# Remarks
Reflection transformation changes the handedness of a coordinate system.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This transformation is singular and the reflection is undefined. |

# See Also
Transform2D Class
Autodesk.Revit.DB Namespace